Catalogs/ШаблоныВыплатПоДоговорамОпеки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>ШаблоныВыплатПоДоговорамОпеки</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Выплаты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВыплачиваетсяПриВозрастеОт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВыплачиваетсяПриВозрастеДо</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособРасчета</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СпособыРасчетаВыплатПоДоговорамОпеки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПрожиточныйМинимум</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПрожиточныеМинимумы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Размер</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИсключаяДатуОт</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВключаяДатуДо</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ШаблоныВыплатПоДоговорамОпеки/Forms/ВыборШаблонаВыплатНаРебенка/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.РежимВыбора Тогда
		Элементы.Список.РежимВыбора = Истина;
	Иначе 
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Параметры.Свойство("ФизическоеЛицо", ФизическоеЛицо);
	
	Если Не ЗначениеЗаполнено(ФизическоеЛицо) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ВозвращаемоеЗначениеУстановлено = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ЕстьОграниченияВыплатПоВозрастуРебенка = ЕстьОграниченияВыплатПоВозрастуРебенка(Значение);
	Если Не ЗначениеЗаполнено(Ребенок) И ЕстьОграниченияВыплатПоВозрастуРебенка Тогда
		ТекстОшибки = НСтр("ru = 'Необходимо указать ребенка, так как выбранный шаблон содержит выплаты с ограничениями по возрасту ребенка.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки, , "Ребенок");
		Возврат;
	ИначеЕсли ЗначениеЗаполнено(Ребенок) И ЕстьОграниченияВыплатПоВозрастуРебенка И Не ДатаРожденияРебенкаУказана(Ребенок) Тогда 
		ТекстОшибки = НСтр("ru = 'Необходимо указать дату рождения ребенка, так как выбранный шаблон содержит выплаты с ограничениями по возрасту ребенка.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки, , "Ребенок");
		Возврат;
	КонецЕсли;
	ОповеститьОВыборе(Новый Структура("Шаблон,Ребенок", Значение, Ребенок));
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ЕстьОграниченияВыплатПоВозрастуРебенка(ШаблонСсылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ШаблоныВыплатПоДоговорамОпекиВыплаты.Ссылка
		|ИЗ
		|	Справочник.ШаблоныВыплатПоДоговорамОпеки.Выплаты КАК ШаблоныВыплатПоДоговорамОпекиВыплаты
		|ГДЕ
		|	ШаблоныВыплатПоДоговорамОпекиВыплаты.Ссылка = &Ссылка
		|	И (ШаблоныВыплатПоДоговорамОпекиВыплаты.ВыплачиваетсяПриВозрастеОт > 0
		|			ИЛИ ШаблоныВыплатПоДоговорамОпекиВыплаты.ВыплачиваетсяПриВозрастеДо > 0)";
	
	Запрос.УстановитьПараметр("Ссылка", ШаблонСсылка);
	РезультатЗапроса = Запрос.Выполнить();
	Возврат Не РезультатЗапроса.Пустой();

КонецФункции

&НаСервереБезКонтекста
Функция ДатаРожденияРебенкаУказана(Ребенок)
	Возврат ЗначениеЗаполнено(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ребенок, "ДатаРождения"));
КонецФункции

#КонецОбласти
